04_OpenFoam/_ref/OpenFOAM-14/incompressibleFluid/simpleRushtonMRF/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        relTol         0;
    }

    "pcorr.*"
    {
        $p;
        tolerance       1e-2;
        relTol          0;

    }

    Phi
    {
        $p;
    }

    MeshPhi
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-2;
        relTol          0;
    }

    "(U|k|omega|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          0.1;
    }

    "(U|k|omega|epsilon)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nNonOrthogonalCorrectors 0;
    nOuterCorrectors  2;
    nCorrectors       2;
    pRefCell          0;
    pRefValue         0;
}

relaxationFactors
{
    fields
    {
        p    0.3;
    }

    equations
    {
        ".*" 0.7;
    }
}

// ************************************************************************* //
